public class Plan {
    /*
    * В классе ConfWork в методе getLineNumberToStart хочу чтобы
    * значение в конфигурационном файле скидфвалось на минус один после прочтения
    *
    *
    *
    * // LogWork
    * написать методы работы с логфайлом
    * написать конструктор для (синглтон)
    *
    * При запуске програмы записать в лог сообщение о старте. Если файл лога создать не удалось
    * сообщить в консоль:
    * - не удалось создать файл
    * - файл пытаюсь создать тут %PATH%
    * - работаю по пользователем %USER%
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    *
    * */
}
